SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/MMLU1S0T8H/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId></eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken></sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-11-06T13:49" ArrivalDateTime="2018-11-06T15:25" FlightNumber="2421" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2421"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MAM"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-06T23:10" ArrivalDateTime="2018-11-07T16:05" FlightNumber="7" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="7"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T19:15" ArrivalDateTime="2018-11-27T20:55" FlightNumber="357" NumberInParty="1" ResBookDesigCode="S" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="BUS"/>      <MarketingAirline Code="9B" FlightNumber="357"/>      <OperatingAirline Code="9B"/>      <OriginLocation   LocationCode="LGW"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T22:35" ArrivalDateTime="2018-11-28T04:50" FlightNumber="8" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="8"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-28T11:30" ArrivalDateTime="2018-11-28T13:18" FlightNumber="2420" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MAM"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2420"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId></eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken></sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-11-06T13:49" ArrivalDateTime="2018-11-06T15:25" FlightNumber="2421" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2421"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MAM"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-06T23:10" ArrivalDateTime="2018-11-07T16:05" FlightNumber="7" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="7"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T19:15" ArrivalDateTime="2018-11-27T20:55" FlightNumber="357" NumberInParty="0" ResBookDesigCode="S" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="BUS"/>      <MarketingAirline Code="9B" FlightNumber="357"/>      <OperatingAirline Code="9B"/>      <OriginLocation   LocationCode="LGW"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T22:35" ArrivalDateTime="2018-11-28T04:50" FlightNumber="8" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="8"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-28T11:30" ArrivalDateTime="2018-11-28T13:18" FlightNumber="2420" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MAM"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2420"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId></eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken></sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-11-06T13:49" ArrivalDateTime="2018-11-06T15:25" FlightNumber="2421" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2421"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MAM"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-06T23:10" ArrivalDateTime="2018-11-07T16:05" FlightNumber="7" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="7"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T19:15" ArrivalDateTime="2018-11-27T20:55" FlightNumber="357" NumberInParty="0" ResBookDesigCode="S" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="BUS"/>      <MarketingAirline Code="9B" FlightNumber="357"/>      <OperatingAirline Code="9B"/>      <OriginLocation   LocationCode="LGW"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T22:35" ArrivalDateTime="2018-11-28T04:50" FlightNumber="8" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="8"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-28T11:30" ArrivalDateTime="2018-11-28T13:18" FlightNumber="2420" NumberInParty="0" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MAM"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2420"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1536168237334!2775199!131073</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-11-06T13:49" ArrivalDateTime="2018-11-06T15:25" FlightNumber="2421" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2421"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MAM"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-06T23:10" ArrivalDateTime="2018-11-07T16:05" FlightNumber="7" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="7"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T19:15" ArrivalDateTime="2018-11-27T20:55" FlightNumber="357" NumberInParty="1" ResBookDesigCode="S" Status="NN">      <DestinationLocation   LocationCode="LHR"/>      <Equipment AirEquipType="BUS"/>      <MarketingAirline Code="9B" FlightNumber="357"/>      <OperatingAirline Code="9B"/>      <OriginLocation   LocationCode="LGW"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-27T22:35" ArrivalDateTime="2018-11-28T04:50" FlightNumber="8" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MEX"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="AM" FlightNumber="8"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="LHR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-28T11:30" ArrivalDateTime="2018-11-28T13:18" FlightNumber="2420" NumberInParty="1" ResBookDesigCode="V" Status="NN">      <DestinationLocation   LocationCode="MAM"/>      <Equipment AirEquipType="E70"/>      <MarketingAirline Code="AM" FlightNumber="2420"/>      <OperatingAirline Code="AM"/>      <OriginLocation   LocationCode="MEX"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>